In [15]:
import pandas as pd
alunosDicionario = {'Nome':['Ricardo', 'Kleber', 'Pedro', 'Carlos'],
         'Nota':[4, 7, 5.5, 9],
         'Aprovado':['Não', 'Sim', 'Não', 'Sim']}

In [16]:
alunosDataFrame= pd.DataFrame(alunosDicionario)

In [17]:
display(alunosDataFrame)

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1   Kleber   7.0      Sim
2    Pedro   5.5      Não
3   Carlos   9.0      Sim

In [18]:
alunosDataFrame.head()

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1   Kleber   7.0      Sim
2    Pedro   5.5      Não
3   Carlos   9.0      Sim

In [19]:
alunosDataFrame.shape

(4, 3)

In [20]:
alunosDataFrame.describe()

           Nota
count  4.000000
mean   6.375000
std    2.136001
min    4.000000
25%    5.125000
50%    6.250000
75%    7.500000
max    9.000000